Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/special_needs_education_primary_schools.html.txt.tmx
Source language: en
Languages: ga

source: Special needs education in primary schools
ga: Oideachas riachtanas speisialta i mbunscoileanna

source: Children with special educational needs may be in ordinary classes in mainstream primary schools or in special classes in these schools
ga: Is féidir le leanaí a bhfuil riachtanais speisialta oideachais acu a bheith i ngnáthranganna i mbunscoileanna den phríomhshruth nó i ranganna speisialta sna scoileanna seo

source: They may get additional educational support from learning support and resource teachers and care support from special needs assistants (SNAs)
ga: Is féidir leo tacaíocht oideachasúil bhreise a fháil ó mhúinteoirí tacaíochta foghlamtha agus ó mhúinteoirí acmhainne agus tacaíocht cúraim ó chúntóirí riachtanas speisialta (SNAs)

source: The National Council for Special Education (NCSE) has published an information booklet for parents, Children with Special Educational Needs (pdf)
ga: D’fhoilsíodh an Chomhairle Náisiúnta um Oideachas Speisialta bileog fhaisnéise do thuismitheoirí, Leanaí a bhfuil Riachtanais Speisialta Oideachais Acu (pdf)

source: A learning support teacher service is generally available to all primary schools
ga: Míníonn na treoirlínte seo aidhmeanna agus gníomhaíochtaí cláir thacaíochta foghlama

source: The Learning Support Guidelines (pdf) published by the Department of Education and Skills explain the aims and activities of learning support programmes.They include the procedures for identifying and selecting children who might have difficulty with reading or mathematics, learning difficulties or special educational needs and who need supplemental teaching
ga: Cuimsíonn siad na modhanna oibre le haghaidh leanaí a mbeidh deacracht acu le léamh agus matamatic, deacrachtaí foghlama nó riachtanais speisialta oideachais acu agus a bhfuil teagasc breise de dhíth orthu a aithint agus a roghnú

source: It is the learning support teachers who provide this extra teaching – see ‘General allocation’ below
ga: Is iad na múinteoirí tacaíochta foghlamtha a chuireann an teagasc breise seo ar fáil – féach ‘Cionroinnt ghinearálta’ thíos

source: Further psychological assessment does not occur until the learning support teacher and the class teacher have tried to address the child’s problems
ga: Ní tharlaíonn aon mheasúnú síceolaíoch breise go dtí go bhfuil iarracht déanta ag an múinteoir tacaíochta foghlama agus an múinteoir ranga dul i ngleic le fadhbanna an linbh

source: Children who continue to have difficulty coping with the curriculum can be psychologically assessed by the National Educational Psychological Service and may be eligible for resource teacher support
ga: B’fhéidir go bhféadfadh an Seirbhís Náisiúnta Síceolaíochta Oideachais measúnú síceolaíoch a dhéanamh ar leanaí a mbíonn deacrachtaí acu fós ag déileáil leis an gcuraclam agus b’fhéidir go mbeidís incháilithe do thacaíocht múinteora acmhainne

source: The Department's Circular Sp Ed 02/05 sets out in detail how teaching resources for children who need additional support in mainstream primary schools are organised
ga: Tá ciorclán eisithe ag an Roinn Oideachais agus Scileanna, Sp Ed 02/05 a leagann amach go mionchruinn conas a eagraítear acmhainní teagaisc do leanaí a bhfuil tacaíocht bhreise de dhíth orthu i mbunscoileanna príomhshrutha

source: Circular 0013/2017 (pdf) outlines the arrangements for allocation of learning support and resource teacher posts for 2017/2018
ga: Tugann ciorclán 0013/2017 (pdf) breac-chuntas ar shocruithe le haghaidh cionroinnt phoist múinteoirí tacaíochta foghlama agus múinteoirí acmhainní 2017/2018

source: Primary schools get a general allocation to meet the needs of children with high incidence or less severe, more commonly occurring special needs
ga: Faigheann bunscoileanna cionroinnt ghinearálta chun freastal ar riachtanais leanaí a bhfuil riachtanais speisialta 'ardmhinicíochta' acu

source: This includes specific learning disabilities such as dyslexia and borderline and mild general learning disabilities
ga: Is féidir le rudaí áirithe a bheith i gceist leis seo – disléicse agus riachtanais tacaíochta foghlama, mar shampla

source: Learning support/resource teachers are appointed to provide support under the general allocation of additional teaching resources to help schools to make suitable provision for:
ga: Ceaptar múinteoirí tacaíochta foghlama/múinteoirí acmhainní chun tacaíocht a sholáthair faoin chionroinnt ghinearálta d’acmhainní breise teagaisc chun cuidiú le scoileanna soláthar cuí a dhéanamh le haghaidh:

source: • Pupils who are eligible for learning-support teaching
ga: • Daltaí atá incháilithe do theagasc tacaíochta foghlamtha

source: • Pupils with learning difficulties*
ga: • Daltaí a bhfuil deacrachtaí foghlamtha acu*

source: • Pupils who have special educational needs arising from high incidence disabilities (borderline-mild general learning disability and specific learning disability)
ga: • Daltaí a bhfuil riachtanais speisialta oideachais acu ag teacht ó mhíchumais ardmhinicíochta (ó mhion-mhíchumas/míchumas teorannach ginearálta foghlamtha agus sain-mhíchumas foghlamtha)

source: * Learning difficulties includes pupils with mild speech and language difficulties, mild social or emotional difficulties and mild co-ordination or attention control difficulties associated with identified conditions such as dyspraxia, attention deficit disorder (ADD), attention deficit hyperactivity disorder (ADHD)
ga: * Cuimsíonn deacrachtaí foghlama daltaí a bhfuil miondeacrachtaí cainte agus teanga acu, miondeacrachtaí sóisialta nó mothúchánacha agus miondeacrachtaí comhordaithe nó deacrachtaí rialaithe airde atá ceangailte le riochtaí aitheanta cosúil le diospraicse, neamhord easnaimh airde (ADD), neamhord hipirghníomhaíochta easnamh airde (ADHD)

source: Pupils with these conditions who have been assessed as being in the low incidence category get individual support
ga: Faigheann na daltaí a bhfuil na riochtaí seo orthu agus a measúnadh a bheith sa chatagóir íosmhinicíochta le tacaíocht aonair a fháil

source: Each school decides how the resources for high incidence support are used and how they are divided among the students who need such support
ga: Cinneann gach scoil conas a úsáidtear na hacmhainní don tacaíocht ardmhinicíochta agus conas a roinntear iad idir na daltaí a bhfuil tacaíocht dá leithéid de dhíth orthu

source: The additional teaching may be provided in the classroom or in small separate groups
ga: Is féidir an teagasc breise a chur ar fáil sa seomra ranga nó i ngrúpaí beaga ar leith

source: Some pupils may need additional one-to-one teaching for a specified period
ga: B’fhéidir go mbeadh teagasc breise duine le duine de dhíth ar roinnt daltaí ar feadh tréimhse shainráite

source: The school must make an individual application for resource teaching hours for children with low incidence or less commonly occurring, more severe special needs
ga: Caithfidh an scoil iarratas aonair a dhéanamh ar uaireanta teagaisc acmhainne do leanaí a bhfuil riachtanais speisialta íosmhinicíochta nó nach dtarlaíonn de ghnáth, acu

source: This includes hearing impairment, visual impairment, moderate general learning disabilities or autistic spectrum disorders
ga: Cuimsíonn siad lagú éisteachta, laige radhairc, míchumais foghlama ginearálta meánach nó mí-oird den speictream uathachais

source: This application is made by the school to the National Council for Special Education (NCSE) through its nationwide network of Special Educational Needs Organisers (SENOs)
ga: Déanann an scoil an t-iarratas seo chuig an gComhairle Náisiúnta um Oideachas Speisialta (CNOS) tríd an ghréasán fhorleitheadach Eagraithe Riachtanas Speisialta Oideachais (SENOs)

source: The NCSE publishes guidelines for schools to follow when applying for resources for pupils with special educational needs
ga: Tá treoirlínte do scoileanna faoi iarratais ar acmhainní do dhaltaí a bhfuil riachtanais speisialta oideachais acu eisithe ag an CNOS

source: Additional resource teachers provide individual support to pupils with low incidence disabilities
ga: Soláthraíonn múinteoirí acmhainní breise tacaíocht aonair do dhaltaí a bhfuil míchumas íosmhinicíochta acu

source: The circulars set out the rules for the qualifications and recruitment of such teachers
ga: Leagann na ciorcláin síos na rialacha le haghaidh na gcáilíochtaí agus earcaíochta de na múinteoirí seo

source: Additional resources will be allocated to schools as an interim measure to support children with Down Syndrome, who are not already supported through the National Council for Special Education’s (NCSE) annual allocation process
ga: Leithdháilfear breis acmhainní ar scoileanna mar bheart eatramhach chun tacú le leanaí a bhfuil Siondróm Down orthu, nach bhfuil tacaíocht á tabhairt dóibh cheana féin trí phróiseas leithdháilte bliantúil na Comhairle Náisiúnta um Oideachas Speisialta (CNOS)

source: Under the interim measure schools will receive 2.5 resource teacher hours per week for each qualifying child
ga: Faoin mbeart eatramhach, gheobhaidh na scoileanna 2.5 uair de chuid múinteoir acmhainne sa tseachtain do gach leanbh cáilitheach

source: Speech and language disorder
ga: Neamhordaithe cainte agus teanga

source: Special classes for pupils with specific speech and language disorder are attached to mainstream primary schools
ga: Tá ranganna speisialta do leanaí a bhfuil sain-neamhordaithe cainte agus teanga orthu ceangailte le bunscoileanna den phríomhshruth

source: Pupils who meet specific criteria may be eligible for such classes
ga: B’fhéidir go mbeadh daltaí a chomhlíonann critéir shainiúla incháilithe do ranganna den chineál sin

source: The Department's Circular 0038/2007 sets out the Criteria for Enrolment in Special Classes for Pupils with Specific Speech and Language Disorder
ga: Leagann ciorclán na Roinne Oideachais agus Scileanna 0038/2007 amach na Critéir le haghaidh Cláraithe i Ranganna Speisialta do Dhaltaí le Sain-neamhoird Cainte agus Teanga

source: Schools may apply to the Special Educational Needs Organiser to establish these classes
ga: Is féidir le scoileanna iarratais a dhéanamh chuig an Eagraí Riachtanas Speisialta Oideachais chun na ranganna a bhunú

source: Schools must have at least 5 eligible pupils in order to retain a class
ga: Caithfidh scoileanna ar a laghad 5 dhalta incháilithe a bheith acu d’fhonn rang a choinneáil

source: A full-time teacher is assigned to each special class and the pupil/teacher ratio is 7:1
ga: Sanntar múinteoir lánaimseartha do gach rang speisialta agus is é an cóimheas daltaí le múinteoir ná 7:1

source: Eligible pupils may spend up to 2 years in a special class
ga: Is féidir le daltaí incháilithe suas le 2 bhliain a chaitheamh i rang speisialta

source: An enhanced capitation grant is paid in respect of each pupil enrolled in these classes
ga: Íoctar deontas caipitíochta méadaithe maidir le gach dalta atá cláraithe sna ranganna seo

source: The Health Service Executive funds the provision of speech and language therapy services for the children attending these classes
ga: Maoiníonn Feidhmeannacht na Seirbhíse Sláinte soláthar seirbhísí teiripe cainte agus teanga

source: If a school has such a class and there are places to spare, these places may be offered to a maximum of 2 pupils who do not meet the eligibility criteria but who could benefit from enrolment in the class
ga: Má tá rang den chineál seo ann agus áiteanna saora ann, b’fhéidir go dtairgeofaí na háiteanna seo d’uasmhéid de 2 dhalta nach gcomhlíonann na critéir incháilithe ach a bhainfeadh tairbhe as a bheith cláraithe sa rang

source: This must be supported by the recommendation of a speech and language therapist and/or a psychologist
ga: Caithfidh sé seo a bheith tacaithe ag moladh ó theiripeoir cainte agus teanga agus/nó ó shíceolaí

source: In general, a child who is eligible for placement in a special class is also eligible for free transport to their nearest class
ga: Go ginearálta, tá leanbh atá incháilithe do shocrúchán i rang speisialta incháilithe chomh maith do iompar saor chuig an rang is cóngaraí dóibh

source: Pupils who meet the criteria for classes may also qualify for additional teaching support (even if there is a special class available)
ga: Tá daltaí a chomhlíonann na critéir do ranganna ach nach bhfuil rang speisialta ar fáil dóibh incháilithe do thacaíocht bhreise teagaisc

source: You may apply for this support to the SENO - see 'How to apply' below
ga: Is féidir iarratas a dhéanamh ar an tacaíocht seo leis an SENO – féach 'Conas a dhéanfaidh mé iarratas' thíos

source: Pupils with mild speech and language difficulties may qualify for teaching support from the school’s general allocation of teaching resources as outlined above
ga: B’fhéidir go mbeadh daltaí a bhfuil miondeacrachtaí cainte agus teanga acu incháilithe do thacaíocht teagaisc ó chionroinnt ghinearálta acmhainní teagaisc na scoile mar a chuirtear síos thuas

source: Children on the autistic spectrum may avail of special needs education in the same way as other children with special needs
ga: Is féidir le leanaí ar speictream an uathachais úsáid a bhaint as oideachas riachtanas speisialta ar an dóigh chéanna le leanaí eile a bhfuil riachtanais speisialta acu

source: There are also specific provisions for them
ga: Tá forálacha sainiúla eile ann dóibh

source: There are a number of special classes for children with autism, which are attached to special and mainstream schools, as well as several special classes for children with Asperger’s Syndrome
ga: Tá roinnt ranganna speisialta ann do leanaí a bhfuil uathachas orthu atá ceangailte le scoileanna speisialta agus príomhshrutha chomh maith le ranganna speisialta éagsúla do leanaí a bhfuil Siondróm Asperger orthu

source: The Home Tuition Scheme funds home programmes for pre-school children on the autistic spectrum who need early educational intervention
ga: Tá rang luath-idirghabhála atá ceangailte le bunscoileanna áirithe do leanaí aois réamscoile atá ar speictream an uathachais

source: The grant aid is for 10 hours' home tuition a week for children aged 2½ to 3 and 20 hours a week for children aged 3
ga: Tá deontas 10 n-uaire oideachais sa bhaile sa tseachtain do leanaí ó 2½ go 3 bliana d'aois agus 20 uair sa tseachtain do leanaí os cionn 3 bliana d'aois

source: The funding is not provided if there is a place in school or early education available to the child
ga: Má tá áit sa scoil nó luathoideachas ar fáil don leanbh, ní bheidh aon mhaoine soláthartha

source: There are also a number of stand-alone facilities providing an applied behavioural analysis (ABA) specific methodology
ga: Tá líon áis neamhspleácha a sholáthraíonn modheolaíocht shainiúil d’anailís fheidhmeach iompraíochta (ABA)

source: These facilities were all recognised as special schools in 2010
ga: D’aithníodh na háiseanna seo mar scoileanna speisialta i 2010

source: There are 4 special reading schools and special classes attached to some ordinary primary schools which specifically support the needs of children with dyslexia
ga: Tá 4 scoil speisialta agus rang speisialta ceangailte le gnáth-bhunscoileanna áirithe a thugann tacaíocht shainiúil do riachtanais leanaí a bhfuil disléicse orthu

source: They have a reduced pupil/teacher ratio of 9:1 and an increased level of capitation grant
ga: Tá cóimheas laghdaithe daltaí le múinteoir de 9:1 agus leibhéal ardaithe de dheontas caipitíochta

source: There are 3 schools for students with hearing impairment and special classes attached to some mainstream schools
ga: Tá 3 scoil speisialta ann agus rang speisialta do leanaí a bhfuil lagú éisteachta orthu ceangailte le scoileanna príomhshrutha áirithe

source: The special classes have a pupil/teacher ratio of 7:1
ga: Tá cóimheas daltaí le múinteoir de 7:1 sna ranganna speisialta seo

source: There is an enhanced subvention and grant aid towards special equipment
ga: Tá teanntaíocht mhéadaithe agus cúnamh deontais ann le haghaidh trealaimh speisialta

source: There is a weekly home tuition Irish Sign Language Support Scheme for deaf pre-school children and deaf schoolgoing pupils to provide training in Irish Sign Language (ISL) for these children, their siblings and parents
ga: Tá Scéim Tacaíochta Teanga Chomharthaíochta na hÉireann teagaisc bhaile seachtainiúil do leanaí bodhra réamhscoile agus do leanaí bodhara a théann ar scoil d’fhonn oiliúint a chur ar fáil do na leanaí seo, dá siblíní agus dá dtuismitheoirí i dTeanga Chomharthaíochta na hÉireann

source: The Home Tuition Programme provides funding to parents to provide education at home for children who (for a number of reasons, such as chronic illness) are unable to attend school
ga: Cuireann an Clár Teagaisc Bhaile maoiniú ar fáil chun oideachas a chur ar fáil sa bhaile do leanaí nach bhfuil (ar réimse cúiseanna amhail tinneas ainsealach) in ann freastal ar scoil

source: The scheme is also available to children with special educational needs who are awaiting a suitable educational placement
ga: Tá an scéim ar fáil do leanaí atá ag fanacht le socrúchán oiriúnach oideachasúil atá luath-idirghabhála ag teastáil uathu

source: Information about the Home Tuition scheme is in the Department's Circular 0046/2016 (pdf)
ga: Déanann ciorclán na Roinne 0046/2016 (pdf) cur síos ar an gClár Teagaisc Bhaile

source: The July Education Programme is a funding arrangement for schools to provide further special needs education in the month of July
ga: Is socrú maoinithe é Clár Oideachais Iúil chun oideachas riachtanas speisialta a chur ar fáil i mí Iúil

source: Special schools and mainstream primary schools with special classes catering for children with autism may choose to extend their education services through the month of July
ga: Is féidir le scoileanna speisialta agus scoileanna den phríomhshruth a bhfuil ranganna speisialta acu ag freastal ar leanaí a bhfuil uathachas orthu a roghnú a seirbhísí oideachais a shíneadhi rith mhí Iúil

source: There is also a July Programme for pupils with a severe/profound general learning disability
ga: Tá Clár Iúil ar fáil chomh maith do leanaí a bhfuil míchumas tromchúiseach/domhain foghlama orthu

source: The funding also covers transport and escort services for the children
ga: Clúdaíonn an maoiniú iompar agus seirbhísí coimhdirí do na leanaí

source: You can find information about the July programme on the Department of Education and Skills website
ga: Tá tuilleadh eolais ar Chlár Oideachais Iúil ar fáil sa suíomh gréasáin na Ranna Oideachais agus Scileanna

source: If schools are not participating in the July Education Programme, home tuition during July is offered as an alternative for the pupils who would normally attend such schools
ga: Mura bhfuil scoileanna páirteach sa Chlár Oideachais Iúil, tairgtear teagasc baile mar mhalairt do na daltaí a bheadh ag freastal ar scoileanna den chineál sin de ghnáth

source: The Visiting Teacher Service provides a teaching and support service to parents and schools for pupils who have difficulties resulting from hearing disability or visual impairment
ga: Cuireann an tseirbhís múinteora cuartaíochta seirbhís teagaisc agus tacaíochta ar fáil do leanaí a bhfuil deacrachtaí acu de thoradh deacrachtaí éisteachta nó lagú radhairc

source: Special needs assistants (SNAs) are allocated to schools to work with children who have specific care needs
ga: Tá cúntóirí riachtanas speisialta (SNAanna) leithdháilte do scoileanna chun oibriú le leanaí a bhfuil riachtanais chúraim speisialta acu

source: They provide non-teaching care support
ga: Soláthraíonn siad tacaíocht cúraim neamhtheagaisc

source: SNAs support pupils who have care needs resulting from a disability, behavioural difficulties or a significant medical issue
ga: Tugann SNAanna tacaíocht do dhaltaí a bhfuil riachtanais chúraim acu de thoradh mhíchumas, deacrachtaí iompair nó ceist leighis suntasach

source: This might include a significant impairment of physical or sensory function or where their behaviour makes them a danger to themselves or other pupils
ga: D’fhéadfadh sé seo lagú suntasach d’fheidhm fhisiceach nó chéadfach a chuimsiú nó an cás ina mbeidís ina gcontúirt dóibh féin nó do dhaltaí eile de thoradh a n-iompraíochta

source: Pupils’ needs could range from needing an assistant for a few hours each week (for example, to help feed or change the pupil(s) or bring them to the toilet) to requiring a full-time assistant
ga: D’fhéadfadh riachtanais na ndaltaí a bheith an-éagsúil – cúntóir a bheith de dhíth orthu ar feadh tréimhse ghairid gach seachtain i gcás amháin (mar shampla, chun iad a chothú nó a gcuid éadaigh a aistriú nó iad a thabhairt chun an leithris) nó cúntóir lánaimseartha a bheith de dhíth orthu i gcás eile

source: SNAs may work with more than one child and can also work on a part-time basis depending on the needs of the school
ga: Is féidir le SNAnna a bheith ag obair le níos mó ná leanbh amháin agus is féidir leo obair ar bhonn páirtaimseartha chomh maith ag brath ar riachtanais na scoile

source: The Department provides more information about the Special Needs Assistants Scheme in Circular 0030/2014 (pdf)
ga: Sonraíonn an Roinn cuspóir na Scéime na gCúntóirí Riachtanas Speisialta in Imlitir 0030/2014 (pdf)

source: If your child has special educational needs you should talk to the school principal about the type of education that would suit your child's needs
ga: Má tá riachtanais speisialta oideachais ag do leanbh, ba cheart caint leis an príomhoide scoile faoin oideachas oiriúnach le riachtanais speisialta do linbh

source: You can also discuss with your local Special Educational Needs Organiser what learning supports or additional resources may be available
ga: Is féidir leat plé a dhéanamh le d'Eagraí Riachtanas Speisialta Oideachais faoi na tacaíochtaí fhoglama nó acmhainní breise atá ar fáil

source: Schools should apply to the National Council for Special Education (NCSE) which administers and processes applications for special educational resources using its network of Special Educational Needs Organisers
ga: Ba cheart do scoileanna iarratas a dhéanamh chuig an Chomhairle Náisiúnta um Oideachas Speisialta (CNOS) a dhéanann riarachán agus a phróiseálann iarratais ar acmhainní oideachais speisialta ag úsáid a ghréasán d’Eagraithe Riachtanas Speisialta Oideachais (SENOs)

source: Application forms for special educational resources and a list of Special Educational Needs Organisers are available on the NCSE website
ga: Tá foirmeacha iarratais d’acmhainní speisialta oideachais agus liosta d’Eagraith Riachtanas Speisialta Oideachais ar fáil ar shuíomh gréasáin an CNOS

source: Application forms for the Home Tuition Scheme 2016 are on the website of the Department of Education and Skills
ga: Tá foirmeacha iarratais don Chlár Teagaisc Bhaile 2016 ar fáil ar láithreán gréasáin na Roinne Oideachais agus Scileanna

source: Home-based July Education Programme 2016 application forms (pdf) are also available on the Department’s website
ga: Tá foirmeacha iarratais (pdf) don Chlár Oideachais Iúil a bhaineann le baile ar fáil ar láithreán gréasáin na Roinne
